In [94]:
import pandas as pd

In [95]:
s=pd.Series(data=[100,'a',{'dic1':5}],index=pd.Index(['id1',20,'third'],name='my_idx'),dtype='object',name='my_name')

In [96]:
s2=pd.Series([100,'a',{'dic1':5}],['pxxx',111,'sss'])

In [97]:
s2.shape

(3,)

In [98]:
books={
    '作者':pd.Series(['余华','残雪','莫言']),
    "作品名称":pd.Series(['活着','红高梁','我与地坛'])
}
df2=pd.DataFrame(books)

In [99]:
#数据框的行索引
i=df2.index.values

In [100]:
#获取df值
df2['作品名称']

0      活着
1     红高梁
2    我与地坛
Name: 作品名称, dtype: object

In [101]:
df2.作者

0    余华
1    残雪
2    莫言
Name: 作者, dtype: object

In [102]:
df2[['作品名称','作者']]

   作品名称  作者
0    活着  余华
1   红高梁  残雪
2  我与地坛  莫言

In [103]:
# 设置行索引
gzmt=pd.read_csv(R'data\600519.csv')

In [104]:
df3=gzmt.set_index('day')

In [105]:
gzmt.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [106]:
df3.loc['2001-10-08','open']

37.0

In [107]:
df3.loc[['2001-10-08','2002-10-08'],'open']

day
2001-10-08    37.00
2002-10-08    28.15
Name: open, dtype: float64

In [108]:
gzmt.loc[0,'day']

'2001-08-27'

In [109]:
#创建布尔列表

布尔列表=[False]*4094
布尔列表[1]=True

In [110]:
df3.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-08-28     6005191  34.99  36.86     37.0    34.61  129647  463463008

In [111]:
#使用条件表达式构造布尔列表
条件1=df3.open<35
条件2=df3.close<35
筛选条件=条件1&条件2
df3.loc[筛选条件]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [112]:
#使用函数作为索引方式
def 筛选条件(df):
    条件1=df3.open<35
    条件2=df3.close<35
    筛选条件=条件1&条件2
    return 筛选条件

In [114]:
df3.loc[筛选条件]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [115]:
#使用Query方法查询数据
df3.query('open<35 and close<35')

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [ ]:
df3.loc['2018-1-2':]